Autodesk.Revit.DB.DirectContext3D.VertexPosition.GetSizeInFloats
Gets the amount of storage that the vertex takes up in a buffer, measured in floats.
Returns:
The number of floats occupied by one vertex of this type.
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPosition.Position
The vertex's position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPosition.#ctor(Autodesk.Revit.DB.XYZ)
Constructs the vertex from a point.
position:
The vertex's position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.DirectContext3D.VertexPosition
A geometry vertex specified as a position in space.
Remarks:
Since these vertices do not have a color
their color is obtained from the Autodesk.Revit.DB.DirectContext3D.EffectInstance
Since:
2017